19-rails-auth/trainshop/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "users".* FROM "users"
---
  def show
    authorized_for(params[:id])
    @user = User.find(params[:id])
    if @user.admin
      @admin_panel = User.all

INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "bobert"], ["password_digest", "$2a$10$4VutzjocB1cJPDUcGPhbwuO3pEtuZnt0mPw4LjNcyND59vmai3Z/m"], ["created_at", "2019-02-12 11:17:10.236598"], ["updated_at", "2019-02-12 11:17:10.236598"]]
---
  def create
    user = User.new(user_params)
    if user.valid?
      user.save