20-rails-auth/trainshop/app/controllers/trains_controller.rb

INSERT INTO "trains" ("name", "price", "created_at", "updated_at", "conductor_id") VALUES (?, ?, ?, ?, ?)  [["name", "fads"], ["price", 33], ["created_at", "2019-03-26 08:27:33.587799"], ["updated_at", "2019-03-26 08:27:33.587799"], ["conductor_id", 3]]
---
  def create
    train = Train.create(train_params)

UPDATE "trains" SET "price" = ?, "updated_at" = ? WHERE "trains"."id" = ?  [["price", 7], ["updated_at", "2019-02-01 15:26:01.639395"], ["id", 8]]
---
  def update
    @train.update(train_params)

SELECT  "trains".* FROM "trains" WHERE "trains"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
  def find_train
    @train = Train.find(params[:id])

SELECT "conductors".* FROM "conductors"
---
  def find_conductors
    @conductors = Conductor.all