17-rails-validations/blog/app/controllers/posts_controller.rb

SELECT "users".* FROM "users"
---
  def new
    @post = Post.new
    @users = User.all

INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "just testing my syntax"], ["content", "does it work?"], ["user_id", 4], ["created_at", "2019-03-19 14:24:41.736461"], ["updated_at", "2019-03-19 14:24:41.736461"]]
---
  def create
    @post = Post.create(post_params)