19-rails-auth/trainshop/app/views/trains/show.html.erb

SELECT "passengers".* FROM "passengers" INNER JOIN "journeys" ON "passengers"."id" = "journeys"."passenger_id" WHERE "journeys"."train_id" = ?  [["train_id", 3]]
---

<% if @train.passengers.length == 0 %>